Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའི་ཐབས་སེམས་ཅན་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་གདུལ་བ་ལ་ཞུགས་པ་ནི་རྒྱ་ཆེན་པོའི་ཆོས་སོ། །
en: (7) Engaging in the methods of a bodhisattva, which guides and ripens the entire ocean of beings, is an extensive quality.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་བསྐལ་པར་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པའི་ཕྱིར་ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་ནི་རྒྱ་ཆེན་པོའི་ཆོས་སོ། །
en: (8) Engaging in the prayer of a bodhisattva, which is entering the entire ocean of realms in order to perform bodhisattva conduct in all buddha realms throughout the endless future kalpas, is an extensive quality.

source: བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་སྐད་ཅིག་རེ་རེ་ལ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ཡོངས་སུ་བསྟན་པ་རྒྱུན་མི་གཅད་པའི་ཕྱིར་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་ནི་རྒྱ་ཆེན་པོའི་ཆོས་སོ། །
en: (9) Engaging in the strength of a bodhisattva, which is to enter an ocean of the ways of the realm of the Dharma so as to continuously manifest the attainment of buddhahood in each instant in all buddha realms, is an extensive quality.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་དུས་གསུམ་གྱི་ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་ཐོབ་པར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་ལ་ཞུགས་པ་ནི་རྒྱ་ཆེན་པོའི་ཆོས་སོ། །
en: (10) Engaging in the knowledge of a bodhisattva, which is to gain the strengths of the tathāgatas so as to attain the unobscured knowledge of all phenomena in the three times, is an extensive quality.

source: རིགས་ཀྱི་བུ་བཅུ་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྒྱ་ཆེན་པོའི་ཆོས་ཚོགས་ཆེན་པོ་དང་ལྡན་པ་རྣམས་ཏེ།
en: “Noble one, those ten are the great accumulations, the vast qualities of the bodhisattvas.

source: དེ་དག་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་རྣམ་པར་ཐར་པ་དེ་ལྟ་བུ་ཕུན་སུམ་ཚོགས་པར་འགྱུར་རོ། །རྣམ་པར་དག་པར་འགྱུར་རོ། །ཡོངས་སུ་འབྱུང་བར་འགྱུར་རོ། །
en: The bodhisattvas who remain within them will obtain this kind of bodhisattva liberation.

source: ཡང་དག་པར་འཕེལ་བར་འགྱུར་རོ། །ཀུན་ནས་འབྱུང་བར་འགྱུར་རོ། །རབ་ཏུ་སྐྱེ་བར་འགྱུར་རོ། །ཡོངས་སུ་འགྲུབ་པར་འགྱུར་རོ། །ཤིན་ཏུ་བརྟན་པར་འགྱུར་རོ། །
en: They will make it pure, cause it to arise, increase it, elevate it, manifest it, accomplish it, make it enduring, make it vast, perfect it, and establish it.”

source: རྣམ་པར་ཡངས་པར་འགྱུར་རོ། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ཡོངས་སུ་གནས་པར་འགྱུར་རོ། །ནོར་བཟངས་ཀྱིས་སྨྲས་པ། འཕགས་མ་ལྷ་མོ་ཁྱོད་ཡུན་ཇི་སྲིད་ཅིག་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས།
en: Sudhana asked, “Āryā, goddess, how long has it been since you set out for the highest, complete enlightenment?”

source: དེས་སྨྲས་པ། རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་གཞི་མེ་ཏོག་གི་སྙིང་པོའི་རྒྱན་གྱིས་བརྒྱན་པ། འདིའི་ཤར་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་སྟོང་ཕྲག་བཅུ་འདས་པའི་ཕ་རོལ་ན་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་དྲི་མ་མེད་པའི་འོད་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: She replied, “Noble one, to the east of this ocean of world realms called Kusuma­tala­garbha­vyūhālaṃkāra, beyond a hundred thousand oceans of world realms, there is an ocean of world realms called Sarva­ratna­vimala­prabhā­vyūha.

source: དེའི་དབུས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འོད་དང་སྨོན་ལམ་གྱི་དབྱངས་ཤེས་བྱ་བ་ཡོད་དོ། །
en: In its center there is a group of world realms called Sarva­tathāgata­prabhā­praṇidhi­nirghoṣa.

source: དེའི་དབུས་ན་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་སྤྲིན་སྣ་ཚོགས་དང་ལྡན་པ་འཇིག་རྟེན་གྱི་འོག་གི་འཚམས་ནས། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཕྲེང་བའི་དྲ་བ་རྒྱ་མཚོས་བརྟན་པ། རིན་པོ་ཆེའི་རྒྱལ་པོ་སྤོས་ཀྱི་རྡོ་རྗེ་ཐམས་ཅད་ཀྱི་རྒྱན་གྱི་ལྷུན་དང་ལྡན་པ། ཁང་པ་བརྩེགས་པའི་རྒྱའི་དབྱིབས་སུ་འདུག་པ་རྣམ་པར་དག་ཅིང་ཀུན་ནས་ཉོན་མོངས་པ་ལྷ་རྫས་ཀྱི་གཞལ་མེད་ཁང་དང་གནས་ཀྱི་སྤྲིན་གྱིས་ཀུན་ཏུ་གང་བ། གསེར་ལྟར་དྲི་མ་མེད་པའི་འོད་ཀྱི་རྒྱན་ཅེས་བྱ་བ་ཡོད་པ་དེར་བསྐལ་པ་ཀུན་ཏུ་སྣང་བའི་རྒྱལ་མཚན་ཅེས་བྱ་བ་བྱུང་སྟེ།
en: In its center is a world realm called Kanaka­vimala­prabhā­vyūha, which has multicolored clouds made of every jewel; its base is a firm ocean of a network of garlands of every jewel; its main body is a display of every perfumed diamond, the king of jewels; it has the shape of a kūṭāgāra; it is both pure and defiled and covered over with clouds of aerial palaces and dwellings made of divine materials.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ནས་སྙིང་པོ་བྱང་ཆུབ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་འོད་སྣ་ཚོགས་ཅན་ཞེས་བྱ་བ་ཡོད་དེ།
en: “There, during a kalpa called Samantāvabhāsa­dhvaja, in that world, there was a bodhimaṇḍa called Sarva­ratna­garbha­vicitrābha.

source: དེར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་དབྱངས་ཤེས་བྱ་བ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ཏེ།
en: There a tathāgata, who was called the Bhagavat Avivartya­dharma­dhātu­nirghoṣa, attained the highest, complete enlightenment of buddhahood.

source: དེའི་ཚེ་དེའི་དུས་ན་ཁོ་མོ་ཡང་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ལྷ་མོ་བསོད་ནམས་སྒྲོན་མ་ཕུན་སུམ་ཚོགས་པ་ཀུན་ནས་དཔལ་གྱི་འོད་ཅེས་བ་བ་ཞིག་ཏུ་གྱུར་ཏེ། བྱང་ཆུབ་ཀྱི་ཤིང་དེ་ལ་འདུག་འདུག་ནས།
en: “At that time, in that time, I was a goddess of the bodhimaṇḍa, named Puṇya­pradīpa­saṃpatketu­prabhā, who dwelled at the Bodhi tree.

source: དེར་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་དེ་མངོན་པར་འཚང་རྒྱ་བའི་རྣམ་པར་འཕྲུལ་པ་མཐོང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་ནས་ཀྱང་ཁོ་མོས་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་རྒྱ་མཚོའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ། །
en: When I saw that tathāgata’s miraculous manifestation of buddhahood, I developed the aspiration to attain the highest, complete enlightenment, and on seeing that tathāgata I attained a samādhi called the light of an ocean of qualities.

source: དེའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་ཀྱི་རྒྱལ་པོའི་གནས་ཀུན་ནས་ཡོངས་སུ་རྒྱས་པའི་དཔལ་གྱི་སྙིང་པོ་ཞེས་བྱ་བར་སྙིང་པོ་བྱང་ཆུབ་དེ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྡོང་པོ་རི་བོ་གཟི་བརྗིད་ཅེས་བྱ་བ་མངོན་པར་སངས་རྒྱས་སོ། །
en: “Subsequently, the Tathāgata Dharma­druma­parvata­tejas attained buddhahood at that bodhimaṇḍa, by that world’s royal capital called Samanta­saṃpūrṇa­śrī­garbhā.

source: ཁོ་མོ་ནི་དེ་ནས་ཤི་འཕོས་ཏེ་སྙིང་པོ་བྱང་ཆུབ་དེ་ཉིད་དུ་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པའི་བསོད་ནམས་འོད་ཅེས་བྱ་བའི་མཚན་མོའི་ལྷ་མོ་ཞིག་ཏུ་གྱུར་ཅིང་འདུག་འདུག་སྟེ།
en: I had passed away and become a night goddess, by the name of Jñāna­śrī­puṇya­prabhā, who dwelled at the bodhimaṇḍa.

source: ཁོ་མོས་དེར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྡོང་པོ་རི་བོ་གཟི་བརྗིད་དེས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་རྣམ་པར་འཕྲུལ་པ་མཐོང་ནས་འགྲོ་བ་ཐམས་ཅད་དུ་ཡོངས་སུ་སྟོན་པའི་མཉམ་པ་ཉིད་ཀྱི་འོད་ཀྱི་ཡུལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ། །
en: “There I saw the Tathāgata Dharma­druma­parvata­tejas’ miraculous manifestation of turning the wheel of the Dharma, and I attained a samādhi called the range of the light of an ocean of qualities.

source: དེའི་འོག་ཏུ་ཁོ་མོས་སྙིང་པོ་བྱང་ཆུབ་དེ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་གསུང་གི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏེ།
en: “Subsequently, I venerated the Tathāgata Sarva­dharma­sāgara­nirghoṣa­rāja at that bodhimaṇḍa.

source: དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་མ་ཐག་ཏུ་ཆོས་ཐམས་ཅད་ཀྱིས་ཡང་དག་པ་འཕེལ་བར་བྱེད་པའི་གནས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ། །
en: As soon as I saw that tathāgata, I attained a samādhi called the state of enhancing the levelsof all dharmas.

source: དེའི་འོག་ཏུ་ཁོ་མོས་སྙིང་པོ་བྱང་ཆུབ་དེ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་འོད་གཟེར་སྒྲོན་མའི་རྒྱལ་མཚན་རྒྱལ་པོ་ཞེས་བ་བ་བསྙེན་བཀུར་ཏེ།
en: “Subsequently, I venerated the Tathāgata Ratna­raśmi­pradīpa­dhvaja­rāja at that bodhimaṇḍa.

source: དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་མ་ཐག་ཏུ་ཁོ་མོས་སངས་རྒྱས་རྒྱ་མཚོ་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ། །
en: As soon as I saw that tathāgata, I attained a samādhi called clouds of the complete light of the tree. “Subsequently, I venerated the Tathāgata Guṇa­sumeru­prabha­tejas at that bodhimaṇḍa. As soon as I saw that tathāgata, I attained a samādhi called the radiance of the ocean of buddhas.

source: དེའི་འོག་ཏུ་ཁོ་མོས་སྙིང་པོ་བྱང་ཆུབ་དེ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་སྒྲའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏེ།
en: “Subsequently, I venerated the Tathāgata Dharma­megha­nirghoṣa­rāja at that bodhimaṇḍa.

source: དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་མ་ཐག་ཏུ་ཁོ་མོས་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ། །དེའི་འོག་ཏུ་ཁོ་མོ་ལྷའི་བུ་མོ་ཞིག་ཏུ་གྱུར་ཏེ།
en: As soon as I saw that tathāgata, I attained a samādhi called the lamp of the ocean of all dharmas.

source: སྙིང་པོ་བྱང་ཆུབ་དེ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་སྐར་མདའ་སྣང་བའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏེ།
en: “Subsequently, I venerated the Tathāgata Jñānolkāvabhāsa­rāja at that bodhimaṇḍa.

source: དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་མ་ཐག་ཏུ་ཁོ་མོས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བྱེད་པའི་སྒྲོན་མ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ། །
en: As soon as I saw that tathāgata, I attained a samādhi called the light of the lamp that ends the suffering of all beings.

source: དེའི་འོག་ཏུ་ཁོ་མོས་སྙིང་པོ་བྱང་ཆུབ་དེ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པ་ཆོས་རྣམ་པར་འཕྲུལ་པའི་ཤུགས་ཀྱི་རྒྱལ་མཚན་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏེ།
en: “Subsequently, I venerated the Tathāgata Dharma­vikurvita­vega­dhvaja­śrī at that bodhimaṇḍa.

source: དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་མ་ཐག་ཏུ་ཁོ་མོས་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཡང་དག་པར་འཇུག་པའི་སྙིང་པོ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ། །
en: As soon as I saw that tathāgata, I attained a samādhi called the light of the essence of comprehending all the tathāgatas in the three times.

source: དེའི་འོག་ཏུ་ཁོ་མོས་སྙིང་པོ་བྱང་ཆུབ་དེ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྒྲོན་མ་ཡེ་ཤེས་ཀྱི་རྣམ་པར་གནོན་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏེ།
en: “Subsequently, I venerated the Tathāgata Dharma­pradīpa­vikrama­jñāna­siṃha at that bodhimaṇḍa.

source: དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་མ་ཐག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་ཡེ་ཤེས་ཐོགས་པ་མེད་པའི་འཁོར་ལོ་སྣང་བའི་གཟི་བརྗིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ། །
en: As soon as I saw that tathāgata, I attained a samādhi called the brilliance of the light of the wheel of unimpeded knowledge of all world realms.

source: དེའི་འོག་ཏུ་ཁོ་མོས་སྙིང་པོ་བྱང་ཆུབ་དེ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱི་རི་བོའི་གཟི་བརྗིད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏེ།
en: “Subsequently, I venerated the Tathāgata Jñāna­bala­parvata­tejas at that bodhimaṇḍa.

source: དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་མ་ཐག་ཏུ་ཁོ་མོས་དུས་གསུམ་གྱི་སེམས་ཅན་གྱི་སྤྱོད་པ་དང་། དབང་པོ་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ། །
en: As soon as I saw that tathāgata, I attained a samādhi called the illumination of the conduct and faculties of beings in the three times.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོས་འཇིག་རྟེན་གྱི་ཁམས་གསེར་ལྟར་དྲི་མ་མེད་པའི་འོད་དེར་བསྐལ་པ་ཀུན་ཏུ་སྣང་བའི་རྒྱལ་མཚན་ལ་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ། ལ་ལ་ནི་ལྷའི་དབང་པོར་གྱུར་ཏེ་བསྙེན་བཀུར་ཏེ། །ལ་ལ་ནི་ཀླུའི་དབང་པོར་གྱུར་པས་བསྙེན་བཀུར་ཏོ། །ལ་ལ་ནི་གནོད་སྦྱིན་གྱི་དབང་པོར་གྱུར་པས། ལ་ལ་ནི་དྲི་ཟའི་དབང་པོར་གྱུར་པས། ལ་ལ་ནི་ལྷ་མ་ཡིན་གྱི་དབང་པོར་གྱུར་པས། ལ་ལ་ནི་ནམ་མཁའ་ལྡིང་གི་དབང་པོར་གྱུར་པས། ལ་ལ་ནི་མིའམ་ཅིའི་དབང་པོར་གྱུར་པས། ལ་ལ་ནི་ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོར་གྱུར་པས། ལ་ལ་ནི་མིའི་དབང་པོར་གྱུར་པས། ལ་ལ་ནི་ཚངས་པའི་དབང་པོར་གྱུར་པས།
en: “In that way, noble one, in the world realm called Kanaka­vimala­prabhā­vyūha, during the kalpa called Samantāvabhāsa­dhvaja, I venerated as many tathāgatas as there are atoms in ten buddha realms.

source: ལ་ལ་ནི་ལྷར་གྱུར་པས། ལ་ལ་ནི་མིར་གྱུར་པས། ལ་ལ་ནི་བུད་མེད་དུ་གྱུར་པས། ལ་ལ་ནི་སྐྱེས་པར་གྱུར་པས། ལ་ལ་ནི་ཁྱེའུ་གྱུར་པས།
en: Sometimes I venerated them when I was a lord of devas; sometimes, when I was a lord of nāgas; sometimes, when I was a lord of yakṣas; sometimes, when I was a lord of gandharvas; sometimes, when I was a lord of asuras; sometimes, when I was a lord of kinnaras; sometimes, when I was a lord of mahoragas; sometimes, when I was a lord of humans; sometimes, when I was a lord of Brahmās; sometimes, when I was a deva; sometimes, when I was a human; sometimes, when I was a woman; sometimes, when I was a man; sometimes, when I was a boy; and sometimes, when I was a girl.

source: ལ་ལ་ནི་བུ་མོར་གྱུར་པས་བསྙེན་བཀུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོས་མཆོད་པའི་ཡོ་བྱད་ཅི་བདོག་པས་མཆོད་དོ། །
en: To all those tathāgatas I made offerings and offered whatever I possessed.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རིམ་གྲོར་བྱས་སོ། །
en: I attended to all those tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པ་ཡང་ཐོས་སོ། །
en: I heard the Dharma that all those tathāgatas taught.

source: དེ་ནས་ཁོ་མོ་ཤི་འཕོས་ནས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་བསྐལ་བ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་དོ། །
en: “After I passed away, I practiced bodhisattva conduct in that world realm for as many kalpas as there are atoms in a buddha realm.

source: དེ་ནས་ཤི་འཕོས་ནས་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་གཞི་དང་སྙིང་པོ་མེ་ཏོག་གི་རྒྱན་གྱིས་བརྒྱན་པ་འདིའི་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་སྐྱེས་ཏེ།
en: “Then, when I passed away, I was reborn in this Sahā world realm in the ocean of world realms called Kusuma­tala­garbha­vyūhālaṃkāra.

source: ཁོ་མོས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ལོག་པར་དད་སེལ་བསྙེན་བཀུར་ཏོ། །
en: “I venerated the Tathāgata Krakucchanda.

source: དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་མ་ཐག་ཏུ་ཁོ་མོས་མུན་པའི་རྡུལ་ཐམས་ཅད་དང་བྲལ་བས་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ། །
en: As soon as I saw that tathāgata, I attained a samādhi called the radiance that is free of all darkening dust.

source: དེའི་འོག་ཏུ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་གསེར་ཐུབ་བསྙེན་བཀུར་ཏེ།
en: “Subsequently, I venerated the Tathāgata Kanaka­muni.

source: དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་མ་ཐག་ཏུ་ཁོ་མོས་ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་སྣང་བ་རྗེས་སུ་འཕྲོ་བར་བྱ་བས་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ། །
en: As soon as I saw that tathāgata, I attained a samādhi called the radiance that spreads throughout all the ocean of realms.

source: དེའི་འོག་ཏུ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་བསོད་སྐྱབས་བསྙེན་བཀུར་ཏེ།
en: “Subsequently, I venerated the Tathāgata Kāśyapa.

source: དེ་བཞིན་གཤེགས་པ། །དེ་མཐོང་མ་ཐག་ཏུ། ཁོ་མོས་སེམས་ཅན་ཐམས་ཅད་ཀྱི། སྐད་རྒྱ་མཚོ་འབྲུག་སྒྲ་སྒྲོག་པའི། སྒྲ་དབྱངས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ། །
en: As soon as I saw that tathāgata, I attained a samādhi called the thunder of the sounds of the ocean of the languages of all beings.

source: དེའི་འོག་ཏུ། ཁོ་མོས་བཅོམ་ལྡན་འདས། དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་འདི་བསྙེན་བཀུར་ཏེ།
en: “Subsequently, I venerated the Tathāgata Vairocana.

source: དེའི་སྙིང་པོ་བྱང་ཆུབ་ལ་དེ་བཞིན་གཤེགས་པ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་རྣམ་པར་འཕྲུལ་པའི་སྒོ་རྒྱ་མཚོ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཡོངས་སུ་སྟོན་པ་མཛད་པ་མཐོང་ནས་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དགའ་བ་ཡངས་པའི་ཤུགས་འབྱུང་བས་སེམས་ཀྱི་སྐད་ཅིག་རྣམ་པར་རྒྱན་པ་འདི་ཐོབ་བོ་དེ་ཐོབ་མ་ཐག་ཏུ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལ་ཞུགས་པར་གྱུར་ཏོ། །
en: At the bodhimaṇḍa, he manifested in each instant of mind an ocean of the gateways to the miraculous manifestations of a tathāgata’s buddhahood. As soon as I saw that, I attained this bodhisattva liberation called the display in each instant of mind of the arising of the power of vast delight. As soon as I had attained it, I entered an ocean of the ways of the realm of phenomena that were as numerous as the atoms in an anabhilāpyānabhilāpya of buddha realms.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་དེ་དག་ཐམས་ཅད་དུ་གཏོགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཇི་སྙེད་པ་དེ་དག་ལ་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ལ་ཞུགས་ཏེ་མཐོང་བར་གྱུར་ཏོ། །
en: I saw that in each of the atoms that were all the atoms within all buddha realms in that ocean of all the ways of the realm of phenomena, there were buddha realms as numerous as the atoms in an anabhilāpyānabhilāpya of buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ལས་སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེ་ན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་སྙིང་པོ་བྱང་ཆུབ་ཏུ་གཤེགས་ཏེ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་སྟོན་པ་མཛད་ཅིང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་རྣམ་པར་འཕྲུལ་པ་རེ་རེས་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་རྒྱས་པར་འགེངས་པ་མཛད་པ་མཐོང་ངོ་། །
en: “I saw that among all those buddha realms, in each buddha realm there was the Bhagavat Vairocana going to the bodhimaṇḍa and in each instant of mind manifesting the miraculous manifestation of the attainment of buddhahood. Each miraculous manifestation of the attainment of buddhahood completely pervaded the ocean of ways of the realm of phenomena.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལས་དེ་བཞིན་གཤེགས་པ་རེ་རེའི་ཞབས་ཀྱི་དྲུང་ན་ཡང་བདག་མངོན་དུ་འདུག་པར་ཤེས་པར་གྱུར་ཏོ། །
en: “I perceived that among all those tathāgatas, I was seated at the feet of every one of those tathāgatas.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྙིང་པོ་བྱང་ཆུབ་ལ་བཞུགས་པ་དེ་དག་གིས་ཆོས་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐོས་པར་གྱུར་ཏོ། །
en: I heard all the Dharma that was taught by all those tathāgatas seated at the bodhimaṇḍa in those world realms.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་སྤྲུལ་པ་རྒྱ་མཚོ་བྱུང་སྟེ། ཆོས་ཀྱི་སྤྲིན་རྒྱ་མཚོ་རབ་ཏུ་སྒྲོག་པ་དང་། རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པ་མཛད་ཅིང་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཕྱོགས་རྒྱ་མཚོ་ཐམས་ཅད་དུ་གཏོགས་པའི་ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་དང་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་ཐམས་ཅད་དང་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་ཀྱི་སེམས་ཅན་འབྱམ་ཀླས་པ་ཐམས་ཅད་འགྲོ་བའི་རྒྱུད་སྣ་ཚོགས་སུ་སྐྱེས་པ་དག་གི་ནང་ན་སེམས་ཅན་གྱི་བསམ་པའི་དབང་དུ་འདུ་ཤེས་ཀྱི་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་འཛིན་ཏོ། །
en: “An ocean of emanations came from each pore of all those tathāgatas, roaring out an ocean of clouds of Dharma, manifesting various miraculous manifestations, and turning the wheel of the Dharma according to the various dispositions of beings born into various kinds of existences, the entire extent of all beings in all the ocean of realms, in all successions of world realms, in the entire extent of world realms within the ocean of every direction in the realm of phenomena.

source: ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །ངེས་པར་རྟོགས་པར་བྱེད་དོ། །དོན་དང་ཚིག་དང་ཡི་གེ་འཛིན་པའི་ཤུགས་ཀྱིས་རྣམ་པར་གནོན་པའི་གཟུངས་ཀྱི་མཐུས་ཡོངས་སུ་འཛིན་ཏོ། །
en: “I possess all those turnings of the Dharma wheel, comprehend them, understand them, and keep them through the power of mental retention that has the prowess of maintaining all their meaning, words, and letters.

source: ཆོས་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་དག་པའི་སྙིང་པོ་ཁོང་དུ་ཆུད་པའི་ཤེས་རབ་ཀྱིས་ཡོངས་སུ་སྦྱོང་ངོ་། །
en: I purify them with wisdom that understands the essence of the pure domain of all the Dharmas.

source: ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པའི་རིགས་པས་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: I understand their categories through skill in the analysis of the ocean of all Dharmas.

source: དུས་གསུམ་ལྟར་རྣམ་པར་ཡངས་པའི་བློས་རྒྱས་པར་འགེངས་སོ། །
en: I permeate them with an understanding that is as vast as the three times.

source: དེ་བཞིན་གཤེགས་པ་དང་མཉམ་པ་ཉིད་ཀྱི་རྗེས་སུ་འགྲ་བའི་ཤེས་རབ་ཀྱིས་མཉམ་པར་བྱེད་ཅིང་ཆོས་ཀྱི་ཚུལ་ཐམས་ཅད་མངོན་པར་སྒྲུབ་བོ། །
en: I perceive them as equal through the wisdom that comprehends the equality of the tathāgatas. I accomplish all the ways of the Dharma.

source: ཚུལ་ཐམས་ཅད་ལ་མདོ་སྡེའི་སྤྲིན་མངོན་པར་སྒྲུབ་བོ། །
en: I attain clouds of sūtras within all the Dharmas.

source: མདོ་སྡེའི་སྤྲིན་ཐམས་ཅད་ལ་ཆོས་རྒྱ་མཚོ་ཡོངས་སུ་གཞོག་པར་བྱེད་དོ། །
en: I am established in an ocean of Dharma within the clouds of all sūtras.

source: ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཆོས་ཀྱི་རྒྱུད་ཐམས་ཅད་ཡང་དག་པར་གཞོལ་བར་བྱེད་དོ། །
en: I am established in the categories of Dharma in the ocean of all Dharmas.

source: ཆོས་ཀྱི་རྒྱུད་ཐམས་ཅད་ལ་ཆོས་ཀྱི་སྤྲིན་ཡོངས་སུ་ཤེས་པར་བྱེད་དོ། །
en: I know clouds of Dharma within the categories of all Dharmas.

source: ཆོས་ཀྱི་སྤྲིན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་རླབས་ཡོངས་སུ་སྐྱེད་དོ། །
en: I give rise to waves of Dharma within the clouds of all Dharmas.

source: ཆོས་ཀྱི་རླབས་ཐམས་ཅད་ལ་ཆོས་ཀྱི་དགའ་བའི་ཤུགས་རྒྱ་མཚོ་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ། །
en: I attain an ocean of the power of delight in the Dharma within the waves of all Dharmas.

source: ཆོས་ཀྱི་དགའ་བའི་ཤུགས་རྒྱ་མཚོ་ཐམས་ཅད་ལས་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཤུགས་མངོན་པར་སྒྲུབ་བོ། །
en: I accomplish the power of attaining the bhūmis within the power of delight in all Dharmas.

source: སའི་ཤུགས་ཐམས་ཅད་ལ་ཏིང་ངེ་འཛིན་རྒྱ་མཚོའི་ཤུགས་མངོན་པར་སྒྲུབ་བོ། །
en: I accomplish the power of an ocean of samādhis within the power of all the bhūmis.

source: ཏིང་ངེ་འཛིན་རྒྱ་མཚོའི་སྤྲིན་ཐམས་ཅད་ལ་སངས་རྒྱས་མཐོང་བ་རྒྱ་མཚོ་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ། །
en: I attain an ocean of visions of the buddhas within the clouds of oceans of all samādhis.

source: སངས་རྒྱས་མཐོང་བ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་སྣང་བ་རྒྱ་མཚོ་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ། །
en: I attain an ocean of light within the ocean of all visions of the buddhas.

source: སྣང་བ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་དུས་གསུམ་གྱི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་གྱིས་ཡོངས་སུ་གཞོག་པར་བྱེད་དོ། །ཕྱོགས་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་རྒྱས་པར་དགའ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་མཐའི་སྤྱོད་པ་རྒྱ་མཚོ་ཚད་མེད་པ་ལ་འཇུག་པའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་ཚད་མེད་པའི་ཡེ་ཤེས་སྣང་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་དཀའ་བ་ཚད་མེད་པ་ཡོངས་སུ་གཏོང་བའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་དཀྱིལ་འཁོར་ཚད་མེད་པ་ཡོངས་སུ་དག་པ་སྣང་བར་བྱ་བའི་ཚུལ་དང་།
en: I am established on the level of the domain of the knowledge of the three times within the ocean of all lights.

source: དེ་བཞིན་གཤེགས་པའི་བཟོད་པའི་ཚད་མེད་པ་ཡོངས་སུ་སྦྱོང་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་བརྩོན་འགྲུས་ཆེན་པོའི་ཤུགས་ཚད་མེད་པ་རྣམ་པར་འཕེལ་བར་བྱ་བའི་མཐུའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་བསམ་གཏན་གྱི་དཀྱིལ་འཁོར་དང་། བསམ་གཏན་གྱི་ཡན་ལག་རྒྱ་མཚོ་ཚད་མེད་པ་ཡོངས་སུ་དག་པར་བྱ་བའི་སྦྱོར་བས་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་རྒྱ་མཚོ་ཚད་མེད་པ་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། རྣམ་པར་དམིགས་པ་སྣང་བར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་རྒྱ་མཚོ་ཚད་མེད་པ་ལ་འཇུག་པར་བྱ་བའི་ཚུལ་དང་།
en: “I comprehend and know the first development of aspiration by those tathāgatas and so on until the cessation of their Dharma.
